In [1]:
import pandas as pd
import numpy as np
import yfinance as yf

In [2]:
df = pd.read_csv("lista acoes.csv", delimiter=";")
df[["ini","fim"]].apply(pd.to_datetime)
df

     acao         ini         fim
0   vale3  01/01/2022  17/05/2022
1   itub3  01/01/2022  17/05/2022
2  sanb11  01/01/2022  17/05/2022

In [3]:
lista_acoes = df.acao
lista_acoes

0     vale3
1     itub3
2    sanb11
Name: acao, dtype: object

In [4]:
acao = "vale3"
df.set_index("acao", inplace=True)
df.loc[acao, "ini"], df

('01/01/2022',
                ini         fim
 acao
 vale3   01/01/2022  17/05/2022
 itub3   01/01/2022  17/05/2022
 sanb11  01/01/2022  17/05/2022)

In [9]:
df.loc[acao,"ini"]
ini = pd.to_datetime(df.loc[acao,"ini"])
fim = df.loc[acao,"fim"]
type(ini), fim

(pandas._libs.tslibs.timestamps.Timestamp, '17/05/2022')

In [6]:
df.index

Index(['vale3', 'itub3', 'sanb11'], dtype='object', name='acao')

In [12]:
cotacoes = pd.DataFrame()
for acao in df.index:
    ini = pd.to_datetime(df.loc[acao,"ini"])
    fim = pd.to_datetime(df.loc[acao,"fim"])
    cotacoes[acao] = yf.download(acao+".SA", start=ini, end=fim,)["Close"]
cotacoes

[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed

                vale3      itub3     sanb11
Date
2022-01-03  78.000000  19.379999  30.590000
2022-01-04  77.080002  19.809999  31.030001
2022-01-05  77.809998  19.410000  30.790001
2022-01-06  79.379997  19.760000  31.040001
2022-01-07  84.000000  20.070000  31.139999
...               ...        ...        ...
2022-05-10  75.540001  20.010000  32.599998
2022-05-11  78.690002  20.500000  32.880001
2022-05-12  77.900002  20.910000  32.750000
2022-05-13  77.809998  21.129999  32.700001
2022-05-16  80.139999  21.230000  33.540001

[92 rows x 3 columns]